In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%sql postgresql://student:student123@127.0.0.1/sparkifydb

Exception during reset or similar
Traceback (most recent call last):
  File "/home/elwin/DataEngineering/DataModeling/lib/python3.6/site-packages/sqlalchemy/pool/base.py", line 682, in _finalize_fairy
    fairy._reset(pool)
  File "/home/elwin/DataEngineering/DataModeling/lib/python3.6/site-packages/sqlalchemy/pool/base.py", line 887, in _reset
    pool._dialect.do_rollback(self)
  File "/home/elwin/DataEngineering/DataModeling/lib/python3.6/site-packages/sqlalchemy/engine/default.py", line 667, in do_rollback
    dbapi_connection.rollback()
psycopg2.errors.AdminShutdown: terminating connection due to administrator command
server closed the connection unexpectedly
	This probably means the server terminated abnormally
	before or while processing the request.

In [7]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('42', 'Harper', 'Barrett', 'M', 'paid'),
 ('49', 'Chloe', 'Cuevas', 'F', 'free'),
 ('6', 'Cecilia', 'Owens', 'F', 'free'),
 ('24', 'Layla', 'Griffin', 'F', 'paid'),
 ('80', 'Tegan', 'Levine', 'F', 'paid')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SONHOTT12A8C13493C', 'AR7G5I41187FB4CE6C', 'Something Girls', 1982, Decimal('233.40363')),
 ('SOHKNRJ12A6701D1F8', 'AR10USD1187B99F3F1', 'Drop of Rain', 0, Decimal('189.57016')),
 ('SOUDSGM12AC9618304', 'ARNTLGG11E2835DDB9', 'Insatiable (Instrumental Version)', 0, Decimal('266.39628')),
 ('SOCIWDW12A8C13D406', 'ARMJAGH1187FB546F3', 'Soul Deep', 1969, Decimal('148.03546')),
 ('SOFSOCN12A8C143F5D', 'ARXR32B1187FB57099', 'Face the Ashes', 2007, Decimal('209.60608'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', 'NaN', 'NaN'),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', 'NaN', 'NaN'),
 ('ARNTLGG11E2835DDB9', 'Clp', '', 'NaN', 'NaN'),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', '35.14968', '-90.04892'),
 ('ARXR32B1187FB57099', 'Gob', '', 'NaN', 'NaN')]

In [7]:
%sql SELECT * FROM times LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(Decimal('1541721977796'), 0, 9, 45, 11, 2018, 4),
 (Decimal('1541722186796'), 0, 9, 45, 11, 2018, 4),
 (Decimal('1541722347796'), 0, 9, 45, 11, 2018, 4),
 (Decimal('1541722492796'), 0, 9, 45, 11, 2018, 4),
 (Decimal('1541722664796'), 0, 9, 45, 11, 2018, 4)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).